transferts/requests/SecurityTokenService-eprik-proxy.http

### calls sts service directly
### 1. needs client certificate where gln is added in certifcate in seetings.json 
### 2. client certificate needs to be registerd in hpd
###       "ws.b2b.cara.int.post-ehealth.ch": {
###        "cert": "/Users/oliveregger/Documents/github/epr-integration-cara/docs/transferts/requests/client.cer",
###        "key": "/Users/oliveregger/Documents/github/epr-integration-cara/docs/transferts/requests/client.key"
###      }    
POST https://test.ahdis.ch/eprik-cara/camel/tra/b2bsts/SecurityTokenService/ HTTP/1.1
Content-Type: application/soap+xml;charset=UTF-8

<soapenv:Envelope xmlns:soapenv="http://www.w3.org/2003/05/soap-envelope">
   <soapenv:Header>
      <wsa:To xmlns:wsa="http://www.w3.org/2005/08/addressing">https://localhost:7443/STS/services/SecurityTokenService</wsa:To>
      <wsa:MessageID xmlns:wsa="http://www.w3.org/2005/08/addressing">urn:uuid:861ec531-9b62-4bf2-98a9-46411dab88d2</wsa:MessageID>
      <wsa:Action xmlns:wsa="http://www.w3.org/2005/08/addressing">http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue</wsa:Action>
   </soapenv:Header>
   <soapenv:Body>
      <wst:RequestSecurityToken xmlns:wst="http://docs.oasis-open.org/ws-sx/ws-trust/200512">
         <ns7:RequestType xmlns:ns7="http://docs.oasis-open.org/ws-sx/ws-trust/200512"
                          xmlns:s1="http://www.w3.org/2001/XMLSchema"
                          xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                          xsi:type="s1:anyURI">http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue</ns7:RequestType>
         <wst:TokenType>http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV2.0</wst:TokenType>
      </wst:RequestSecurityToken>
   </soapenv:Body>
</soapenv:Envelope>